/* P R E V I E W */
/* НА САМОМ ДЕЛЕ БУДЕТ КРУТОЕ НОВОГОДНЕЕ ДЕМО */

/*

Christmas Example
Written on Wct

*/

Le AJ		// В AH помещаем "J" - номер функции 
		// для выполнения прерыванием "CB".
Lk AN AB	// В регистр DX кладём адрес
		// проживания товарища текста
Mn CB		// Выполняем прерывание "CB".
 
Le AI		// Функция "I".
Mn CB		// Выполнение функции "I".
Mn CA		// Выполнение функции "Ca".


An Ak	"							"
An Ak	"           *             ,				"
An Ak	"                       _/^\_				"
An Ak	"                      <     >				"
An Ak	"     *                 /.-.\         *			"
An Ak	"              *        `/&\`                   *	"
An Ak	"                      ,@.*;@,				"
An Ak	"                     /_o.I %_\    *			"
An Ak	"        *           (`'--:o(_@;			"
An Ak	"                   /`;--.,__ `')             *		"
An Ak	"                  ;@`o % O,*`'`&\ 			"
An Ak	"            *    (`'--)_@ ;o %'()\      *		"
An Ak	"                 /`;--._`''--._O'@;			"
An Ak	"                /&*,()~o`;-.,_ `""`)			"
An Ak	"     *          /`,@ ;+& () o*`;-';\			"
An Ak	"               (`""--.,_0 +% @' &()\			"
An Ak	"               /-.,_    ``''--....-'`)  *		"
An Ak	"          *    /@%;o`:;'--,.__   __.'\			"
An Ak	"              ;*,&(); @ % &^;~`"`o;@();         *	"
An Ak	"              /(); o^~; & ().o@*&`;&%O\		"
An Ak	"        jgs   `"="==""==,,,.,="=="==="`		"
An Ak	"           __.----.(\-''#####---...___...-----._	"
An Ak	"         '`         \)_`"""""`				"
An Ak	"                 .--' ')				"
An Ak   "               o(  )_-\				"
An Ak	"                 `"""` `				"
An Ak	" H A P P Y   N E W   Y E A R!  C O D E D   I N   W C T " 

Ce	// Символ, указывающий на то, что строка закончилась.
